ArtShare/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index

        artist = User.find(params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "water"], ["updated_at", "2021-09-16 16:09:32.155465"], ["id", 4]]
---
    def update
        artwork = Artwork.find(params[:id])
        if artwork.update(artwork_params)