ArtShare/app/controllers/artwork_shares_controller.rb

    def index
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"