ArtShare/app/controllers/comments_controller.rb

    def index
        commenter = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]