ArtShare/app/controllers/users_controller.rb

  def index
    if params[:user][:username] # gets user[username] from value
      name = params[:user][:username]
      user = User.find_by(username: name)
      render json: user
    else
      render json: User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "name"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "Angele"]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "fismnan"], ["id", 1]]